using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace BookLibrary.Repositoryes
{
    public class RequestRepository: RepositoryConnection
    {
        
        //2. Получать количество книг определенного автора в библиотеке.
        //3. Получать количество книг определенного жанра в библиотеке.
        //4. Получать булевый флаг о том, есть ли книга определенного автора и с определенным названием в библиотеке.
        //5. Получать булевый флаг о том, есть ли определенная книга на руках у пользователя.
        //6. Получать количество книг на руках у пользователя.
        //7. Получение последней вышедшей книги.
        //public List<Book>
        //1. Получать список книг определенного жанра и вышедших между определенными годами.
        //8. Получение списка всех книг, отсортированного в алфавитном порядке по названию.
        //9. Получение списка всех книг, отсортированного в порядке убывания года их выхода.
    }
}
